
namespace imajuscule::audio {

        // http://www-mmsp.ece.mcgill.ca/Documents/AudioFormats/WAVE/WAVE.html

        enum class WaveFormat : uint16_t {
            PCM =          0x0001, // PCM (Linear quantization, represented using signed values)
            IEEE_FLOAT =   0x0003, // IEEE float
            ALAW =         0x0006, // 8-bit ITU-T G.711 A-law
            MULAW =        0x0007, // 8-bit ITU-T G.711 µ-law
            EXTENSIBLE =   0xFFFE  // Determined by SubFormat
        };

    std::string to_string(WaveFormat f);

        void makeDescription(std::string &s, int16_t num_channels, float length_in_seconds, int32_t sample_rate);
        void makeDescription(std::string &s, int16_t num_channels, float length_in_seconds);

    std::string formatSampleRateKHz(int32_t sample_rate);

        struct WAVPCMHeader {
            std::array<int8_t, 4> chunk_id;
            int32_t chunk_size;
            std::array<int8_t, 4> format;
            std::array<int8_t, 4> subchunk1_id;
            int32_t subchunk1_size;
            WaveFormat audio_format;
            int16_t num_channels;
            int32_t sample_rate;
            int32_t byte_rate;
            int16_t block_align;
            int16_t bits_per_sample;
            std::array<int8_t, 4> subchunk2_id;
            int32_t subchunk2_size; // subchunk2_size denotes the number of samples.

            unsigned int countFrames() const {
                if(0 == block_align) {
                    // header has not been read yet
                    return 0;
                }
                Assert(0 == subchunk2_size % block_align);
                Assert(block_align);
                return subchunk2_size / block_align;
            }

            unsigned int countSamples() const {
                return countFrames() * num_channels;
            }

            unsigned int getSampleSize() const {
                Assert(bits_per_sample % 8 == 0);
                return bits_per_sample / 8;
            }

            float getLengthInSeconds() const {
                return countFrames() / static_cast<float>(sample_rate);
            }

            void makeDescription(std::string & desc, bool with_sample_rate) const;
        };

        enum class NChannels {
            ONE = 1,
            TWO = 2,
            MONO = 1,
            STEREO = 2
        };

        template<typename T>
        NChannels numberToNChannels(T n) {
            if (n==1) {
                return NChannels::ONE;
            }
            if (n==2) {
                return NChannels::TWO;
            }
            Assert(0);
            return NChannels::ONE;
        }

        enum class WaveFileFormat {
            BeginSupported,

            RIFF = BeginSupported,
            WaveIR,

            EndSupported,

            Unknown = EndSupported
        };

        constexpr auto getWavChunkId(WaveFileFormat f) {
            switch(f) {
                case WaveFileFormat::RIFF:
                    return "RIFF";
                case WaveFileFormat::WaveIR:
                    return "wvIR";
                default:
                    return "XXXX";
            }
        }
        constexpr auto getWavWAVEId(WaveFileFormat f) {
            switch(f) {
                case WaveFileFormat::RIFF:
                    return "WAVE";
                case WaveFileFormat::WaveIR:
                    return "ver1";
                default:
                    return "XXXX";
            }
        }

        static bool isFormatSupported(WaveFormat format) {
            switch(format) {
                case WaveFormat::PCM:
                case WaveFormat::IEEE_FLOAT:
                    return true;
                default:
                    return false;
            }
        }

        static WAVPCMHeader pcm_(WaveFileFormat const file_format,
                                 WaveFormat const format,
                                 int const num_frames,
                                 int const sample_rate,
                                 NChannels const n_channels,
                                 int const bytes_per_sample) {
            Assert(bytes_per_sample);
            auto const num_channels = to_underlying(n_channels);
            auto const size_data = num_frames * num_channels * bytes_per_sample;
            WAVPCMHeader ret {
                {0,0,0,0},
                static_cast<int32_t>(sizeof(WAVPCMHeader) + size_data),
                {0,0,0,0},
                {'f','m','t',' '},
                16,
                format,
                static_cast<int16_t>(num_channels),
                sample_rate,
                sample_rate * bytes_per_sample * num_channels,
                static_cast<int16_t>(bytes_per_sample * num_channels),
                static_cast<int16_t>(bytes_per_sample * 8),
                {'d','a','t','a'},
                size_data
            };

            memcpy(ret.chunk_id.data(), getWavChunkId(file_format), 4);
            memcpy(ret.format.data(), getWavWAVEId(file_format), 4);

            return ret;
        }

        enum class SampleFormat {
            signed_16,
            signed_24,
            signed_32,
            float_32,
            float_64
        };

        template<typename T>
        struct AudioSample;

        template<>
        struct AudioSample<int16_t> {
            static constexpr auto format = SampleFormat::signed_16;
        };

        template<>
        struct AudioSample<int24_t> {
            static constexpr auto format = SampleFormat::signed_24;
        };

        template<>
        struct AudioSample<int32_t> {
            static constexpr auto format = SampleFormat::signed_32;
        };

        template<>
        struct AudioSample<float> {
            static constexpr auto format = SampleFormat::float_32;
        };

        template<>
        struct AudioSample<double> {
            static constexpr auto format = SampleFormat::float_64;
        };

        template<int SAMPLE_SIZE>
        struct SignedTypeForSampleSize;

        template<int SAMPLE_SIZE>
        struct FloatTypeForSampleSize;

        template<WaveFormat FMT, int SAMPLE_SIZE>
        struct TypeFor;


        template <>
        struct SignedTypeForSampleSize<1> {
            using type = int8_t;
            static_assert(sizeof(type) == 1);
        };

        template <>
        struct SignedTypeForSampleSize<2> {
            using type = int16_t;
            static_assert(sizeof(type) == 2);
        };

        template <>
        struct SignedTypeForSampleSize<3> {
            using type = int24_t;
            static_assert(sizeof(type) == 3);
        };

        template <>
        struct SignedTypeForSampleSize<4> {
            using type = int32_t;
            static_assert(sizeof(type) == 4);
        };


        template <>
        struct FloatTypeForSampleSize<4> {
            using type = float;
            static_assert(sizeof(type) == 4);
        };

        template <>
        struct FloatTypeForSampleSize<8> {
            using type = double;
            static_assert(sizeof(type) == 8);
        };

        template<int SAMPLE_SIZE>
        struct TypeFor<WaveFormat::PCM, SAMPLE_SIZE> {
            using type = typename SignedTypeForSampleSize<SAMPLE_SIZE>::type;
        };

        template<int SAMPLE_SIZE>
        struct TypeFor<WaveFormat::IEEE_FLOAT, SAMPLE_SIZE> {
            using type = typename FloatTypeForSampleSize<SAMPLE_SIZE>::type;
        };

        constexpr auto bytes_per_sample(SampleFormat f) {
            switch(f) {
                case SampleFormat::signed_16:
                    return 2;
                case SampleFormat::signed_24:
                    return 3;
                case SampleFormat::signed_32:
                case SampleFormat::float_32:
                    return 4;
                case SampleFormat::float_64:
                    return 8;
            }
            return 0;
        }

        static
#ifdef NDEBUG
        constexpr
#endif
        bool is_signed(SampleFormat const f) {
